1s/ERP/Conf/Documents/Лико_ЗакрытиеЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗакрытиеЗаказа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаказыРаскрой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказРаскрой</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_ЗаказНаРаскрой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ЗатратыПоЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ЗатратыПоЗаказу</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоШт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метраж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаливки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грамматура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходКраски</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентГрамматура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражПМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентПереноса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЦветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентКМетражу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавленоНаВыброс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВСмеси</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДавальческоеСырье</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНастроечногоМатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСекции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦвета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_УчетГотовыхЭтикеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_УчетГотовыхЭтикеток</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_МестаУчетаГотовыхЭтикеток</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПриложения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтатусыРоликовПослеПеремотки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтатусыРоликовПослеПеремотки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РоликПослеПеремотки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РоликУпакован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РоликУтилизирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РоликНаНамотке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РоликУшелСНамотки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РоликЗаблокирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВПлан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыФормированияПаллет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыФормированияПаллет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переупаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеСНеордерногоСклада</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗакрытиеЗаказа/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроверкаДублей(Отказ);
	//+ Лико m.shenderov 25.05.2018
	ПроверкаДублейРаскрой(Отказ); 
	//- Лико m.shenderov 25.05.2018
	
	// --> Начало Лико Ефимов ЕВВ 18.01.2021
	Если НЕ Отказ Тогда
		ПроверитьНаличиеВыпусков(Отказ);
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 18.01.2021
	
	Если Не Отказ Тогда 
		МассивЗавершенныхСтатусовРоликовПослеПеремотки = Новый Массив;
		МассивЗавершенныхСтатусовРоликовПослеПеремотки.Добавить(Перечисления.Лико_СтатусыРоликовПослеПеремотки.РоликУпакован);
		МассивЗавершенныхСтатусовРоликовПослеПеремотки.Добавить(Перечисления.Лико_СтатусыРоликовПослеПеремотки.РоликУтилизирован);
		МассивЗавершенныхСтатусовРоликовПослеПеремотки.Добавить(Перечисления.Лико_СтатусыРоликовПослеПеремотки.РоликУшелСНамотки);
		Для каждого стр из Заказы Цикл 
			// --> Начало Лико Ефимов ЕВВ 27.02.2025
			Если Стр.Заказ.Площадка = Справочники.Лико_Площадки.Линкс Тогда
				// Для Линкс проверим, не осталось ли необработанных роликов
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка,
					|	ЯССМ_ОбъектыНоменклатуры.СтатусРоликаПослеПеремотки КАК СтатусРоликаПослеПеремотки,
					|	ЯССМ_ОбъектыНоменклатуры.РабочийЦентрВыпускаВРоликеПослеПеремотки КАК РабочийЦентрВыпускаВРоликеПослеПеремотки
					|ИЗ
					|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
					|ГДЕ
					|	ЯССМ_ОбъектыНоменклатуры.ЗаказКлиента = &ЗаказКлиента
					|	И НЕ ЯССМ_ОбъектыНоменклатуры.ПометкаУдаления
					|	И ЯССМ_ОбъектыНоменклатуры.СтатусРоликаПослеПеремотки <> ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыРоликовПослеПеремотки.ПустаяСсылка)
					|	И НЕ ЯССМ_ОбъектыНоменклатуры.СтатусРоликаПослеПеремотки В (&МассивЗавершенныхСтатусовРоликовПослеПеремотки)
					|
					|УПОРЯДОЧИТЬ ПО
					|	ЯССМ_ОбъектыНоменклатуры.ДатаФормирования";   
				
				Запрос.УстановитьПараметр("ЗаказКлиента", Стр.Заказ); 
				Запрос.УстановитьПараметр("МассивЗавершенныхСтатусовРоликовПослеПеремотки", МассивЗавершенныхСтатусовРоликовПослеПеремотки);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Отказ = Истина;
					Сообщить("" + Ссылка + " не удалось провести: необходимо завершить работу с роликом """ + Выборка.Ссылка + """ (статус """ + Выборка.СтатусРоликаПослеПеремотки + """, РЦ """ + Выборка.РабочийЦентрВыпускаВРоликеПослеПеремотки + """)");
				КонецЦикла;	
				
				Если НЕ Отказ Тогда
					// Проверим, что по заказу нет остатков НЗП	
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
						|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
						|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка
						|ИЗ
						|	РегистрНакопления.ТоварыВЯчейках.Остатки(
						|			,
						//|			Ячейка = &ЯчейкаБуфер И
						|				Номенклатура.ВидНоменклатуры = &ВидНоменклатурыНЗП
						|				И Характеристика.Лико_ЗаказНоменклатуры = &Заказ) КАК ТоварыВЯчейкахОстатки";
					
					//Запрос.УстановитьПараметр("ЯчейкаБуфер", Стр.Заказ.Площадка.БуферСнятыхРоликовПеремотки.ЛикоЯчейка);
					Запрос.УстановитьПараметр("ВидНоменклатурыНЗП", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);
					Запрос.УстановитьПараметр("Заказ", Стр.Заказ);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Отказ = Истина;
						Сообщить("" + Ссылка + " не удалось провести: есть остаток по ролику """ + ВыборкаДетальныеЗаписи.Серия + """ в ячейке """ + ВыборкаДетальныеЗаписи.Ячейка + """");
					КонецЦикла;
				КонецЕсли;
				
				Если НЕ Отказ Тогда
					ТекРабочийЦентр = Лико_Дополнительно.ЗаказСейчасНаТачпаде(Стр.Заказ);
					Если ЗначениеЗаполнено(ТекРабочийЦентр) Тогда
						Отказ = Истина;
						Сообщить("" + Ссылка + " не удалось провести: заказ " + Стр.Заказ.НомерБезПрефикса + " все еще установлен на тачпаде """ + ТекРабочийЦентр + """");
					КонецЕсли;
				КонецЕсли;
				
	            Если НЕ Отказ Тогда
					// Для Линкс нужно заполнить вкладку Производство, поэтому заодним и закроем заказ здесь,
					// а не в Лико_Дополнительно.ЗакрытьЭтапыИЗаказ (там заказ уже будет закрыт, поэтому записываться повторно не будет)
					ЗаказОбъект = Стр.Заказ.ПолучитьОбъект(); 
					ЗаказОбъект.ДатаЗакрытия = Дата;
					ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
					ЗаказОбъект.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт; 
					ЗаказОбъект.Производство.Очистить();
					ЗаказОбъект.ЗаполнитьЗатратыПроизводства(Ложь);
					ЗаказОбъект.ДополнительныеСвойства.Вставить("Лико_ЗаполнитьВыработку");
					Попытка
						ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
					Исключение
						Отказ = Истина;
						ВызватьИсключение "Не удалось изменить статус документа """ + ЗаказОбъект + """ на ""Завершен"": " + ОписаниеОшибки();
					КонецПопытки;
				Иначе
					Возврат;
				КонецЕсли;
			КонецЕсли;
			// <-- Конец Лико Ефимов ЕВВ 27.02.2025
			// --> Начало Лико Ефимов ЕВВ 08.01.2018
			// ДатаЗакрытия перенес в свою процедуру, чтобы 2 раза не записывать заказ
			Лико_Дополнительно.ЗакрытьЭтапыИЗаказ(Стр.Заказ, Дата);
			// --> Начало Лико Ефимов ЕВВ 08.01.2018
			Лико_Планирование.ПеренестиЗаказ(стр.Заказ, Справочники.Лико_ЭтапыВыполненияЗаказа.ЗакрытиеЗаказа);
			//+ Лико m.shenderov 25.05.2018
			Лико_Дополнительно.АктуализацияРезерваМатериаловПоЗаказу(Стр.Заказ);
			//- Лико m.shenderov 25.05.2018
			
		КонецЦикла;	
		//+ Лико m.shenderov 25.05.2018
		Для каждого Стр Из ЗаказыРаскрой Цикл
			ЗакрытьЗаказыНаРаскрой(Стр.ЗаказРаскрой);			
		КонецЦикла;
		
		
		
		//- Лико m.shenderov 25.05.2018
		
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 08.04.2020
	Если НЕ Отказ Тогда
		МассивЗаказов = Заказы.ВыгрузитьКолонку("Заказ");
		МассивЭтаповВыполнения = Новый Массив;
		МассивЭтаповВыполнения.Добавить(Справочники.Лико_ЭтапыВыполненияЗаказа.ОПП);
		Документы.Лико_ЗакрытиеЗаказа.УстановитьДатуОбработкиЭтаповВРегистреЭтапыЗаказа(МассивЗаказов, МассивЭтаповВыполнения);
		// --> Начало Лико Ефимов ЕВВ 30.08.2024
		Лико_Дополнительно.ОтменитьЗаявкиНаФормыПриЗакрытииЗаказа(МассивЗаказов);
		// <-- Конец Лико Ефимов ЕВВ 30.08.2024
	КонецЕсли;	
	// <-- Конец Лико Ефимов ЕВВ 08.04.2020
	
	// <-- Начало Лико Яцун С. В. 07.04.2025 
	Если Не Отказ И Площадка = Справочники.Лико_Площадки.Линкс Тогда
		СформироватьИОтправитьПисьмоОПроверкеКоличестваВыпускаИКоличестваПереданногоНаВК();	
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 07.04.2025
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
//+ ---> Лико2.5 m.shenderov 22.04.2022
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);  
//- <--- Лико2.5 m.shenderov 22.04.2022
	
	
КонецПроцедуры 

Процедура СформироватьИОтправитьПисьмоОПроверкеКоличестваВыпускаИКоличестваПереданногоНаВК() // <-- Начало Лико Яцун С. В. 07.04.2025
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПроверкаВыпустилиБольшеЧемПередалиНаВК = Ложь;
	
	Адресаты = "TPetrova@okil-sato.ru;NShadova@okil-sato.ru;DSakhno@okil-sato.ru";
	ТемаПисьма = "Расхождение при проверке количества переданного на ВК";
	ТекстПисьма = "Закрыли заказы, по которым есть расхождения с переданным на ВК количеством и расходом материала (номер документа " + Номер + ")."; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗакрытиеЗаказаЗаказы.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВТ_ЗаказыДокумента
		|ИЗ
		|	Документ.Лико_ЗакрытиеЗаказа.Заказы КАК Лико_ЗакрытиеЗаказаЗаказы
		|ГДЕ
		|	Лико_ЗакрытиеЗаказаЗаказы.Ссылка = &Ссылка
		|	И Лико_ЗакрытиеЗаказаЗаказы.Заказ.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.Линкс)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_ПеремещениеПаллетаСодержимое.Серия КАК Серия
		|ПОМЕСТИТЬ ВТ_КоробкиВРастаркеКУдалению
		|ИЗ
		|	Документ.Лико_ПеремещениеПаллета КАК Лико_ПеремещениеПаллета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПеремещениеПаллета.Содержимое КАК Лико_ПеремещениеПаллетаСодержимое
		|		ПО Лико_ПеремещениеПаллета.Ссылка = Лико_ПеремещениеПаллетаСодержимое.Ссылка
		|ГДЕ
		|	Лико_ПеремещениеПаллета.Проведен
		|	И НЕ Лико_ПеремещениеПаллета.ПометкаУдаления
		|	И Лико_ПеремещениеПаллета.ЯчейкаПолучатель = &ЯчейкаРастарка
		|	И Лико_ПеремещениеПаллета.ПричинаРастарки = ЗНАЧЕНИЕ(Перечисление.Лико_ПричиныРастарки.ПереупаковкаОшибкаМаркировки)
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ПеремещениеПаллетаСодержимое.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
		|	СУММА(Лико_ФормированиеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке) КАК КоличествоВыпущеноВсего
		|ПОМЕСТИТЬ ВТ_ЗаказыСВыпусками
		|ИЗ
		|	Документ.Лико_ФормированиеПаллета КАК Лико_ФормированиеПаллета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
		|		ПО Лико_ФормированиеПаллета.Ссылка = Лико_ФормированиеПаллетаСодержимое.Ссылка
		|			И Лико_ФормированиеПаллета.Ссылка = Лико_ФормированиеПаллетаСодержимое.Ссылка
		|			И (Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры В
		|				(ВЫБРАТЬ
		|					ВТ_ЗаказыДокумента.Заказ
		|				ИЗ
		|					ВТ_ЗаказыДокумента))
		|			И (НЕ Лико_ФормированиеПаллетаСодержимое.Серия В
		|					(ВЫБРАТЬ
		|						Т.Серия
		|					ИЗ
		|						ВТ_КоробкиВРастаркеКУдалению КАК Т))
		|ГДЕ
		|	Лико_ФормированиеПаллета.Проведен
		|	И НЕ Лико_ФормированиеПаллета.ПометкаУдаления
		|	И Лико_ФормированиеПаллета.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыФормированияПаллет.ВыпускПродукции)
		|	И НЕ Лико_ФормированиеПаллета.ВыпускИзРастарки
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыДокумента.Заказ КАК Заказ,
		|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал) КАК СтатьяЗатрат,
		|	ВТ_ЗаказыДокумента.Заказ.МетражКВМ / ВЫБОР
		|		КОГДА ВТ_ЗаказыДокумента.Заказ.Тираж = 0
		|			ТОГДА 1
		|		ИНАЧЕ ВТ_ЗаказыДокумента.Заказ.Тираж
		|	КОНЕЦ КАК КвМетровВТысШт
		|ПОМЕСТИТЬ ВТ_ЗаказыСгруппировано
		|ИЗ
		|	ВТ_ЗаказыДокумента КАК ВТ_ЗаказыДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыДокумента.Заказ,
		|	ВТ_ЗаказыДокумента.Заказ.МетражКВМ / ВЫБОР
		|		КОГДА ВТ_ЗаказыДокумента.Заказ.Тираж = 0
		|			ТОГДА 1
		|		ИНАЧЕ ВТ_ЗаказыДокумента.Заказ.Тираж
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыСгруппировано.Заказ КАК Заказ,
		|	СУММА(ЕСТЬNULL(Лико_ЗатратыПоЗаказуОбороты.КоличествоОборот, 0)) КАК КоличествоКвМРасходМатериала,
		|	ВТ_ЗаказыСгруппировано.КвМетровВТысШт КАК КвМетровВТысШт
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ЗаказыСгруппировано КАК ВТ_ЗаказыСгруппировано
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
		|				,
		|				,
		|				,
		|				(ЗаказКлиента, СтатьяЗатрат) В
		|					(ВЫБРАТЬ
		|						Т.Заказ,
		|						Т.СтатьяЗатрат
		|					ИЗ
		|						ВТ_ЗаказыСгруппировано КАК Т)) КАК Лико_ЗатратыПоЗаказуОбороты
		|		ПО ВТ_ЗаказыСгруппировано.Заказ = Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента
		|			И ВТ_ЗаказыСгруппировано.СтатьяЗатрат = Лико_ЗатратыПоЗаказуОбороты.СтатьяЗатрат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыСгруппировано.Заказ,
		|	ВТ_ЗаказыСгруппировано.КвМетровВТысШт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Заказ КАК Заказ,
		|	СУММА(Лико_УчетГотовыхЭтикетокОбороты.КоличествоПриход) КАК КоличествоПриход
		|ПОМЕСТИТЬ ВТЛинксПереданоНаВК
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_УчетГотовыхЭтикеток.Обороты(, , , Место = ЗНАЧЕНИЕ(Перечисление.Лико_МестаУчетаГотовыхЭтикеток.Перемотка)) КАК Лико_УчетГотовыхЭтикетокОбороты
		|		ПО ВТ_Итог.Заказ = Лико_УчетГотовыхЭтикетокОбороты.ЗаказКлиента
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итог.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Заказ КАК Заказ,
		|	ВТ_Итог.Заказ.Тираж КАК КоличествоЗаказано,
		|	ВТ_Итог.КоличествоКвМРасходМатериала КАК КоличествоКвМРасходМатериала,
		|	ЕСТЬNULL(ВТЛинксПереданоНаВК.КоличествоПриход, 0) * ВТ_Итог.КвМетровВТысШт КАК КоличествоКвМПереданоНаВК,
		|	ЕСТЬNULL(ВТЛинксПереданоНаВК.КоличествоПриход, 0) * ВТ_Итог.КвМетровВТысШт - ВТ_Итог.КоличествоКвМРасходМатериала КАК КоличествоРазница,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Заказ.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка)
		|				ИЛИ ВТ_Итог.Заказ.Комбинированный
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеПроверять,
		|	ВТ_ЗаказыСВыпусками.КоличествоВыпущеноВсего КАК КоличествоВыпущеноВсего
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛинксПереданоНаВК КАК ВТЛинксПереданоНаВК
		|		ПО ВТ_Итог.Заказ = ВТЛинксПереданоНаВК.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыСВыпусками КАК ВТ_ЗаказыСВыпусками
		|		ПО ВТ_Итог.Заказ = ВТ_ЗаказыСВыпусками.Заказ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЯчейкаРастарка", Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Площадка.СкладГП, "ЯчейкаРастарка", Неопределено));
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
		
	Для каждого Строка из ТаблицаРезультат Цикл
		Если Строка.КоличествоРазница > 0 И НЕ Строка.НеПроверять Тогда
			ТекстПисьма = ТекстПисьма + "<br>"  + Символы.ПС + "Заказ " + Строка.Заказ.НомерБезПрефикса + ": тираж " + Строка.КоличествоЗаказано + " тыс.шт., выпущено " + Строка.КоличествоВыпущеноВсего + 
			" тыс.шт., расход материала " + Строка.КоличествоКвМРасходМатериала + " кв.м., передано на ВК " + Строка.КоличествоКвМПереданоНаВК + " кв.м., превышение " + (Строка.КоличествоРазница) + " кв.м.";
			ПроверкаВыпустилиБольшеЧемПередалиНаВК = Истина;	
		КонецЕсли;		
	КонецЦикла;
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "№", "N");
	ТемаПисьма = СтрЗаменить(ТемаПисьма, "№", "N");
	Если ПроверкаВыпустилиБольшеЧемПередалиНаВК Тогда
		Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, ТемаПисьма, Адресаты,,,,,, Ложь);
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 07.04.2025

Процедура ПроверитьНаличиеВыпусков(Отказ) // --> Начало Лико Ефимов ЕВВ 18.01.2021
	
	Если Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
		// нужно проверить, были ли по заказам выпуски (если были списания)
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗакрытиеЗаказаЗаказы.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.Лико_ЗакрытиеЗаказа.Заказы КАК Лико_ЗакрытиеЗаказаЗаказы
		|ГДЕ
		|	Лико_ЗакрытиеЗаказаЗаказы.Ссылка = &Ссылка
		|	И Лико_ЗакрытиеЗаказаЗаказы.Заказ.ВидЗаказа <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ТестированиеМатериалов)
		|	И Лико_ЗакрытиеЗаказаЗаказы.Заказ.ТипЗаказа <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказы.Заказ КАК Заказ,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Лико_БланкЭтапа.Ссылка ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК ЕстьЗакрытие
		|ПОМЕСТИТЬ ВТ_ЗаказыСПризнакомЗакрытия
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
		|		ПО ВТ_Заказы.Заказ = Лико_БланкЭтапа.ЗаказПокупателя
		|			И (Лико_БланкЭтапа.Проведен)
		|			И (НЕ Лико_БланкЭтапа.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Заказы.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыСПризнакомЗакрытия.Заказ КАК Заказ,
		|	ВТ_ЗаказыСПризнакомЗакрытия.ЕстьЗакрытие КАК ЕстьЗакрытие,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Лико_ФормированиеПаллетаСодержимое.Ссылка ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК ЕстьВыпуск,
		|	ВТ_ЗаказыСПризнакомЗакрытия.Заказ.НомерБезПрефикса КАК НомерБезПрефикса
		|ИЗ
		|	ВТ_ЗаказыСПризнакомЗакрытия КАК ВТ_ЗаказыСПризнакомЗакрытия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
		|		ПО ВТ_ЗаказыСПризнакомЗакрытия.Заказ = Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры
		|			И (Лико_ФормированиеПаллетаСодержимое.Ссылка.Проведен)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыСПризнакомЗакрытия.Заказ,
		|	ВТ_ЗаказыСПризнакомЗакрытия.ЕстьЗакрытие,
		|	ВТ_ЗаказыСПризнакомЗакрытия.Заказ.НомерБезПрефикса";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ЕстьЗакрытие И НЕ ВыборкаДетальныеЗаписи.ЕстьВыпуск Тогда
				Отказ = Истина;
				Сообщить("По заказу №" + ВыборкаДетальныеЗаписи.НомерБезПрефикса + " есть закрытие материалов, но нет выпуска. Закрытие этого заказа невозможно");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 18.01.2021

Процедура ПроверкаДублей(Отказ)
	//Отказ = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗакрытиеЗаказаЗаказы.Ссылка КАК Закрытие,
	|	Лико_ЗакрытиеЗаказаЗаказы.Заказ КАК Заказ,
	|	КОЛИЧЕСТВО(Лико_ЗакрытиеЗаказаЗаказы.Заказ) КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Лико_ЗакрытиеЗаказа.Заказы КАК Лико_ЗакрытиеЗаказаЗаказы
	|ГДЕ
	|	Лико_ЗакрытиеЗаказаЗаказы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗакрытиеЗаказаЗаказы.Ссылка,
	|	Лико_ЗакрытиеЗаказаЗаказы.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Заказ КАК Заказ,
	|	ВТ.Заказ.НомерБезПрефикса КАК Номер,
	|	ВТ.Закрытие КАК Закрытие,
	|	ВТ.Количество КАК Количество,
	|	Лико_ЗакрытиеЗаказаЗаказы.Ссылка КАК Закрытие2
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ЗакрытиеЗаказа.Заказы КАК Лико_ЗакрытиеЗаказаЗаказы
	|		ПО ВТ.Закрытие <> Лико_ЗакрытиеЗаказаЗаказы.Ссылка
	|			И ВТ.Заказ = Лико_ЗакрытиеЗаказаЗаказы.Заказ
	|			И (Лико_ЗакрытиеЗаказаЗаказы.Ссылка.Проведен)
	|ГДЕ
	|	(ВТ.Количество > 1
	|			ИЛИ НЕ Лико_ЗакрытиеЗаказаЗаказы.Заказ ЕСТЬ NULL)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Количество>1 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Заказ "+Выборка.Номер+ " указан в данном документе несколько раз!";  
			Сообщение.Сообщить();
			Отказ = Истина;
		ИначеЕсли ЗначениеЗаполнено(Выборка.Закрытие2) Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Заказ "+Выборка.Номер+ " указан ранее в документе Закрытия " +Выборка.Закрытие2 +"!";  
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаДублейРаскрой(Отказ)
	//Отказ = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗакрытиеЗаказаЗаказы.Ссылка КАК Закрытие,
	|	Лико_ЗакрытиеЗаказаЗаказы.ЗаказРаскрой КАК Заказ,
	|	КОЛИЧЕСТВО(Лико_ЗакрытиеЗаказаЗаказы.ЗаказРаскрой) КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Лико_ЗакрытиеЗаказа.ЗаказыРаскрой КАК Лико_ЗакрытиеЗаказаЗаказы
	|ГДЕ
	|	Лико_ЗакрытиеЗаказаЗаказы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗакрытиеЗаказаЗаказы.Ссылка,
	|	Лико_ЗакрытиеЗаказаЗаказы.ЗаказРаскрой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Заказ КАК Заказ,
	|	ВТ.Заказ.Номер КАК Номер,
	|	ВТ.Закрытие КАК Закрытие,
	|	ВТ.Количество КАК Количество,
	|	Лико_ЗакрытиеЗаказаЗаказы.Ссылка КАК Закрытие2
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ЗакрытиеЗаказа.ЗаказыРаскрой КАК Лико_ЗакрытиеЗаказаЗаказы
	|		ПО ВТ.Закрытие <> Лико_ЗакрытиеЗаказаЗаказы.Ссылка
	|			И ВТ.Заказ = Лико_ЗакрытиеЗаказаЗаказы.ЗаказРаскрой
	|			И (Лико_ЗакрытиеЗаказаЗаказы.Ссылка.Проведен)
	|ГДЕ
	|	(ВТ.Количество > 1
	|			ИЛИ НЕ Лико_ЗакрытиеЗаказаЗаказы.ЗаказРаскрой ЕСТЬ NULL)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Количество>1 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Заказ на раскрой № "+Выборка.Номер+ " указан в данном документе несколько раз!";  
			Сообщение.Сообщить();
			Отказ = Истина;
		ИначеЕсли ЗначениеЗаполнено(Выборка.Закрытие2) Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Заказ  на раскрой № "+Выборка.Номер+ " указан ранее в документе Закрытия " +Выборка.Закрытие2 +"!";  
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗакрытьЗаказыНаРаскрой (Заказ) //+Лико m.shenderov 25.05.2018
	ЗаказОбъект=Заказ.ПолучитьОбъект();
	//ЗаказОбъект=Документы.Лико_ЗаказНаРаскрой.СоздатьДокумент();
	ЗаказОбъект.Состояние=Справочники.Лико_ЭтапыВыполненияЗаказа.ЗакрытиеЗаказа;
	ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 25.05.2018

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если НЕ ЗначениеЗаполнено(Площадка) Тогда
		Сообщить("В документе """ + Ссылка + """ не заполнена площадка");
		Отказ = Истина;
	КонецЕсли;
	
	Если Площадка.Организация <> Организация Тогда
		Организация = Площадка.Организация;
	КонецЕсли;
		
	//+ ---> Лико2.5 m.shenderov 30.03.2022
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	//- <--- Лико2.5 m.shenderov 30.03.2022
   
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	//+ ---> Лико2.5 m.shenderov 22.04.2022
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	//- <--- Лико2.5 m.shenderov 22.04.2022
	
КонецПроцедуры
